liste = ["A", "a" ,"À", "à", "Â", "â", "Ä", "ä", "Ã", "ã", "B", "b", "C", "c", "ç", "D", "d", "E", "e", "é", "È", "è",
"Ê", "ê", "Ë", "ë", "F", "f", "G", "g", "H", "h", "I", "i", "Ì", "ì", "Î", "î", "Ï", "ï", "J", "j", "K", "k", "L", "l",
"M", "m", "N", "n", "Ñ", "ñ", "O", "o", "Ò", "ò", "Ô", "ô", "Ö", "ö", "Õ", "õ", "P", "p", "Q", "q","R", "r", "S", "s", 
"T", "t", "U", "u", "Ù","ù", "Û", "û", "Ü", "ü", "V", "v", "W","w", "X","x", "Y", "y", "ÿ","Z", "z", "_", "-", "'", ".",
",", ";", ":", "!","?", "@", "&", "§", "~", "^", "`", "¨", "°", "|", "(", ")","{", "}", "[", "]", "0", "1", "2", "3", 
"4", "5", "6", "7", "8", "9", "²", "*", "+", "=", "%", "µ","€", "$", "¤", "£", "É", "Ÿ", "Ç", "Æ", "æ", "Œ", "œ", "«", 
"»", "–", "’", "Ă", "ă", "Ā", "ā", "Å", "å", "Ą", "ą", "Ć", "ć", "Ċ", "ċ", "Č", "č", "Ď", "ď", "Đ", "đ", "Ė", "ė", "Ě", 
"ě", "Ē", "ē", "Ę", "ę", "Ġ", "ġ", "Ģ", "ģ", "Ħ", "ħ", "Ī", "ī", "Į", "į", "Ĳ", "ĳ", "Ķ", "ķ", "Ļ", "ļ", "Ł", "ł", "Ń", 
"ń", "Ň", "ň", "Ņ", "ņ", "Ő", "ő", "Ø", "ø", "Ŕ", "ŕ", "Ř", "ř", "Ś", "ś", "Š", "š", "Ș", "ș", "Ț", "ț", "Ť", "ť", "Ū", 
"ū", "Ů", "ů", "Ų", "ų", "Ű", "ű", "Ź", "ź", "Ż", "ż", "Ž", "ž", "ẞ", "ß", "“", "”", "‘", "¡", "¿", ";","/", "<", ">"]

mot = input("Entrer le mot de passe ")
chaine = str()

def test(chaine,mot):
	if chaine == mot:
		print("Les mot de passe est: ", chaine)

def brute_test():
	for a in liste:
		chaine = a
		test(chaine,mot)

		for b in liste:
			chaine = a + b
			test(chaine,mot)

			for c in liste:
				chaine = a + b + c 
				test(chaine,mot)

				for d in liste:
					chaine = a + b + c + d
					test(chaine,mot)

					for e in liste:
						chaine = a + b + c + d + e
						test(chaine,mot)

						for f in liste:	
							chaine = a + b + c + d + e + f
							test(chaine,mot)


brute_test()